SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
/**********************************************************************************************************  
2013-9-22  
by jiezhi320   ILI9341 driver  
**********************************************************************************************************/   
#include "drv_lcd.h"   
#include "stm32f4xx.h"   
#include "board.h"   
#include "rtthread.h"  
#include "font.h" 

   
   
//输出重定向   
#define printf               rt_kprintf //使用rt_kprintf来输出   
//#define printf(...)   
   
struct rt_device _lcd_device;    //设备框架结构体  RTGRAPHIC_PIXEL_FORMAT_RGB565   
//#define NEX_SELECT            FSMC_Bank1_NORSRAM4   
   
   
//内联函数定义,用以提高性能   
#ifdef __CC_ARM                          /* ARM Compiler    */   
#define lcd_inline                  static __inline   
#elif defined (__ICCARM__)              /* for IAR Compiler */   
#define lcd_inline                  inline   
#elif defined (__GNUC__)                /* GNU GCC Compiler */   
#define lcd_inline                  static __inline   
#else   
#define lcd_inline                  static   
#endif   
   
   
static void delay_ms(rt_uint32_t cnt)   
{   
    volatile rt_uint32_t dl;   
    while(cnt--)   
    {   
        for(dl=0; dl<2000; dl++);   
    }   
}   
static void delay_us(rt_uint32_t cnt)   
{   
    volatile rt_uint32_t dl;   
    while(cnt--)   
    {   
        for(dl=0; dl<2; dl++);   
    }   
}

//LCD的画笔颜色和背景色	   
u16 POINT_COLOR=0x0000;	//画笔颜色
u16 BACK_COLOR=0xFFFF;  //背景色    
   
   
//管理LCD重要参数   
//默认为竖屏   
_lcd_dev lcddev;   
   
//写寄存器函数   
//regval:寄存器值   
lcd_inline  void LCD_WR_REG(vu16 regval)   
{   
    //regval = regval;      //使用-O2优化的时候,必须插入的延时   
    LCD->LCD_REG = regval; //写入要写的寄存器序号   
}   
//写LCD数据   
//data:要写入的值   
lcd_inline  void LCD_WR_DATA(vu16 data)   
{   
    //data = data;          //使用-O2优化的时候,必须插入的延时   
    LCD->LCD_RAM = data;   
}   
//读LCD数据   
//返回值:读到的值   
lcd_inline  u16 LCD_RD_DATA(void)   
{   
    //vu16 ram;         //防止被优化   
    //ram = ;   
    //return ram;   
    return LCD->LCD_RAM;   
}   
//写寄存器   
//LCD_Reg:寄存器地址   
//LCD_RegValue:要写入的数据   
void LCD_WriteReg(vu16 LCD_Reg, vu16 LCD_RegValue)   
{   
    LCD->LCD_REG = LCD_Reg;      //写入要写的寄存器序号   
    LCD->LCD_RAM = LCD_RegValue;//写入数据   
}   
//读寄存器   
//LCD_Reg:寄存器地址   
//返回值:读到的数据   
u16 LCD_ReadReg(vu16 LCD_Reg)   
{   
    LCD_WR_REG(LCD_Reg);        //写入要读的寄存器序号   
    delay_us(5);   
    return LCD_RD_DATA();       //返回读到的值   
}   
//开始写GRAM   
void LCD_WriteRAM_Prepare(void)   
{   
    LCD->LCD_REG = lcddev.wramcmd;   
}   
//LCD写GRAM   
//RGB_Code:颜色值   
void LCD_WriteRAM(u16 RGB_Code)   
{   
    LCD->LCD_RAM = RGB_Code;//写十六位GRAM   
}   
      
   
   
//设置光标位置   
//Xpos:横坐标   
//Ypos:纵坐标   
void LCD_SetCursor(u16 Xpos, u16 Ypos)   
{   
    if(lcddev.id == 0X9341 || lcddev.id == 0X5310)   
    {   
        LCD_WR_REG(lcddev.setxcmd);   
        LCD_WR_DATA(Xpos >> 8);   
        LCD_WR_DATA(Xpos & 0XFF);   
        LCD_WR_REG(lcddev.setycmd);   
        LCD_WR_DATA(Ypos >> 8);   
        LCD_WR_DATA(Ypos & 0XFF);   
    }   
    else if(lcddev.id == 0X6804)   
    {   
        if(lcddev.dir == 1)Xpos = lcddev.width - 1 - Xpos; //横屏时处理   
        LCD_WR_REG(lcddev.setxcmd);   
        LCD_WR_DATA(Xpos >> 8);   
        LCD_WR_DATA(Xpos & 0XFF);   
        LCD_WR_REG(lcddev.setycmd);   
        LCD_WR_DATA(Ypos >> 8);   
        LCD_WR_DATA(Ypos & 0XFF);   
    }   
    else if(lcddev.id == 0X5510)   
    {   
        LCD_WR_REG(lcddev.setxcmd);   
        LCD_WR_DATA(Xpos >> 8);   
        LCD_WR_REG(lcddev.setxcmd + 1);   
        LCD_WR_DATA(Xpos & 0XFF);   
        LCD_WR_REG(lcddev.setycmd);   
        LCD_WR_DATA(Ypos >> 8);   
        LCD_WR_REG(lcddev.setycmd + 1);   
        LCD_WR_DATA(Ypos & 0XFF);   
    }   
    else   
    {   
        if(lcddev.dir == 1)Xpos = lcddev.width - 1 - Xpos; //横屏其实就是调转x,y坐标   
        LCD_WriteReg(lcddev.setxcmd, Xpos);   
        LCD_WriteReg(lcddev.setycmd, Ypos);   
    }   
}   
//从ILI93xx读出的数据为GBR格式，而我们写入的时候为RGB格式。   
//通过该函数转换   
//c:GBR格式的颜色值   
//返回值：RGB格式的颜色值   
u16 LCD_BGR2RGB(u16 c)   
{   
    u16  r, g, b, rgb;   
    b = (c >> 0) & 0x1f;   
    g = (c >> 5) & 0x3f;   
    r = (c >> 11) & 0x1f;   
    rgb = (b << 11) + (g << 5) + (r << 0);   
    return(rgb);   
}   
//当mdk -O1时间优化时需要设置   
//延时i   
void opt_delay(u8 i)   
{   
    while(i--);   
}   
//读取个某点的颜色值   
//x,y:坐标   
//返回值:此点的颜色   
u16 LCD_ReadPoint(u16 x, u16 y)   
{   
    vu16 r = 0, g = 0, b = 0;   
    if(x >= lcddev.width || y >= lcddev.height)return 0;  //超过了范围,直接返回   
    LCD_SetCursor(x, y);   
    if(lcddev.id == 0X9341 || lcddev.id == 0X6804 || lcddev.id == 0X5310)LCD_WR_REG(0X2E); //9341/6804/3510 发送读GRAM指令   
    else if(lcddev.id == 0X5510)LCD_WR_REG(0X2E00); //5510 发送读GRAM指令   
    else LCD_WR_REG(R34);                           //其他IC发送读GRAM指令   
    if(lcddev.id == 0X9320)opt_delay(2);                //FOR 9320,延时2us   
    LCD_RD_DATA();                                  //dummy Read   
    opt_delay(2);   
    r = LCD_RD_DATA();                                  //实际坐标颜色   
    if(lcddev.id == 0X9341 || lcddev.id == 0X5310 || lcddev.id == 0X5510)       //9341/NT35310/NT35510要分2次读出   
    {   
        opt_delay(2);   
        b = LCD_RD_DATA();   
        g = r & 0XFF;       //对于9341/5310/5510,第一次读取的是RG的值,R在前,G在后,各占8位   
        g <<= 8;   
    }   
    if(lcddev.id == 0X9325 || lcddev.id == 0X4535 || lcddev.id == 0X4531 || lcddev.id == 0XB505 || lcddev.id == 0XC505)return r;    //这几种IC直接返回颜色值   
    else if(lcddev.id == 0X9341 || lcddev.id == 0X5310 || lcddev.id == 0X5510)return (((r >> 11) << 11) | ((g >> 10) << 5) | (b >> 11)); //ILI9341/NT35310/NT35510需要公式转换一下   
    else return LCD_BGR2RGB(r);                     //其他IC   
}

void LCD_DrawPoint(u16 x,u16 y)
{
	LCD_SetCursor(x,y);		//?????? 
	LCD_WriteRAM_Prepare();	//????GRAM
	LCD->LCD_RAM=POINT_COLOR; 
}
//????
//x,y:??
//color:??
void LCD_Fast_DrawPoint(u16 x,u16 y,u16 color)
{	   
	if(lcddev.id==0X9341||lcddev.id==0X5310)
	{
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(x>>8); 
		LCD_WR_DATA(x&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(y>>8); 
		LCD_WR_DATA(y&0XFF);
	}else if(lcddev.id==0X5510)
	{
		LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(x>>8);  
		LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(x&0XFF);	  
		LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(y>>8);  
		LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(y&0XFF); 
	}else if(lcddev.id==0X6804)
	{		    
		if(lcddev.dir==1)x=lcddev.width-1-x;//?????
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(x>>8); 
		LCD_WR_DATA(x&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(y>>8); 
		LCD_WR_DATA(y&0XFF);
	}else
	{
 		if(lcddev.dir==1)x=lcddev.width-1-x;//????????x,y??
		LCD_WriteReg(lcddev.setxcmd,x);
		LCD_WriteReg(lcddev.setycmd,y);
	}			 
	LCD->LCD_REG=lcddev.wramcmd; 
	LCD->LCD_RAM=color; 
}	 

   
   
//设置LCD的自动扫描方向   
//注意:其他函数可能会受到此函数设置的影响(尤其是9341/6804这两个奇葩),   
//所以,一般设置为L2R_U2D即可,如果设置为其他扫描方式,可能导致显示不正常.   
//dir:0~7,代表8个方向(具体定义见lcd.h)   
//9320/9325/9328/4531/4535/1505/b505/8989/5408/9341/5310/5510等IC已经实际测试   
void LCD_Scan_Dir(u8 dir)
{
	u16 regval=0;
	u16 dirreg=0;
	u16 temp;  
	u16 xsize,ysize;
	if(lcddev.dir==1&&lcddev.id!=0X6804)//横屏时，对6804不改变扫描方向！
	{			   
		switch(dir)//方向转换
		{
			case 0:dir=6;break;
			case 1:dir=7;break;
			case 2:dir=4;break;
			case 3:dir=5;break;
			case 4:dir=1;break;
			case 5:dir=0;break;
			case 6:dir=3;break;
			case 7:dir=2;break;	     
		}
	}
	if(lcddev.id==0x9341||lcddev.id==0X6804||lcddev.id==0X5310||lcddev.id==0X5510)//9341/6804/5310/5510,很特殊
	{
		switch(dir)
		{
			case L2R_U2D://从左到右,从上到下
				regval|=(0<<7)|(0<<6)|(0<<5); 
				break;
			case L2R_D2U://从左到右,从下到上
				regval|=(1<<7)|(0<<6)|(0<<5); 
				break;
			case R2L_U2D://从右到左,从上到下
				regval|=(0<<7)|(1<<6)|(0<<5); 
				break;
			case R2L_D2U://从右到左,从下到上
				regval|=(1<<7)|(1<<6)|(0<<5); 
				break;	 
			case U2D_L2R://从上到下,从左到右
				regval|=(0<<7)|(0<<6)|(1<<5); 
				break;
			case U2D_R2L://从上到下,从右到左
				regval|=(0<<7)|(1<<6)|(1<<5); 
				break;
			case D2U_L2R://从下到上,从左到右
				regval|=(1<<7)|(0<<6)|(1<<5); 
				break;
			case D2U_R2L://从下到上,从右到左
				regval|=(1<<7)|(1<<6)|(1<<5); 
				break;	 
		}
		if(lcddev.id==0X5510)dirreg=0X3600;
		else dirreg=0X36;
 		if((lcddev.id!=0X5310)&&(lcddev.id!=0X5510))regval|=0X08;//5310/5510不需要BGR   
		if(lcddev.id==0X6804)regval|=0x02;//6804的BIT6和9341的反了	   
		LCD_WriteReg(dirreg,regval);
 		if((regval&0X20)||lcddev.dir==1)
		{
			if(lcddev.width<lcddev.height)//交换X,Y
			{
				temp=lcddev.width;
				lcddev.width=lcddev.height;
				lcddev.height=temp;
 			}
		}else  
		{
			if(lcddev.width>lcddev.height)//交换X,Y
			{
				temp=lcddev.width;
				lcddev.width=lcddev.height;
				lcddev.height=temp;
 			}
		}  
		if(lcddev.dir==1&&lcddev.id!=0X6804)
		{
			xsize=lcddev.height;
			ysize=lcddev.width;
		}else
		{
			xsize=lcddev.width;
			ysize=lcddev.height;
		}
		if(lcddev.id==0X5510)
		{
			LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setxcmd+2);LCD_WR_DATA((xsize-1)>>8); 
			LCD_WR_REG(lcddev.setxcmd+3);LCD_WR_DATA((xsize-1)&0XFF); 
			LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setycmd+2);LCD_WR_DATA((ysize-1)>>8); 
			LCD_WR_REG(lcddev.setycmd+3);LCD_WR_DATA((ysize-1)&0XFF);
		}else
		{
			LCD_WR_REG(lcddev.setxcmd); 
			LCD_WR_DATA(0);LCD_WR_DATA(0);
			LCD_WR_DATA((xsize-1)>>8);LCD_WR_DATA((xsize-1)&0XFF);
			LCD_WR_REG(lcddev.setycmd); 
			LCD_WR_DATA(0);LCD_WR_DATA(0);
			LCD_WR_DATA((ysize-1)>>8);LCD_WR_DATA((ysize-1)&0XFF);  
		}
  	}else 
	{
		switch(dir)
		{
			case L2R_U2D://从左到右,从上到下
				regval|=(1<<5)|(1<<4)|(0<<3); 
				break;
			case L2R_D2U://从左到右,从下到上
				regval|=(0<<5)|(1<<4)|(0<<3); 
				break;
			case R2L_U2D://从右到左,从上到下
				regval|=(1<<5)|(0<<4)|(0<<3);
				break;
			case R2L_D2U://从右到左,从下到上
				regval|=(0<<5)|(0<<4)|(0<<3); 
				break;	 
			case U2D_L2R://从上到下,从左到右
				regval|=(1<<5)|(1<<4)|(1<<3); 
				break;
			case U2D_R2L://从上到下,从右到左
				regval|=(1<<5)|(0<<4)|(1<<3); 
				break;
			case D2U_L2R://从下到上,从左到右
				regval|=(0<<5)|(1<<4)|(1<<3); 
				break;
			case D2U_R2L://从下到上,从右到左
				regval|=(0<<5)|(0<<4)|(1<<3); 
				break;	 
		}
		if(lcddev.id==0x8989)//8989 IC
		{
			dirreg=0X11;
			regval|=0X6040;	//65K   
	 	}else//其他驱动IC		  
		{
			dirreg=0X03;
			regval|=1<<12;  
		}
		LCD_WriteReg(dirreg,regval);
	}
}     
   
   
   
   
//设置LCD显示方向   
//dir:0,竖屏；1,横屏   
void LCD_Display_Dir(u8 dir)   
{   
    if(dir == 0)            //竖屏   
    {   
        lcddev.dir = 0; //竖屏   
        lcddev.width = 240;   
        lcddev.height = 320;   
        if(lcddev.id == 0X9341 || lcddev.id == 0X6804 || lcddev.id == 0X5310)   
        {   
            lcddev.wramcmd = 0X2C;   
            lcddev.setxcmd = 0X2A;   
            lcddev.setycmd = 0X2B;   
            if(lcddev.id == 0X6804 || lcddev.id == 0X5310)   
            {   
                lcddev.width = 320;   
                lcddev.height = 480;   
            }   
        }   
        else if(lcddev.id == 0x5510)   
        {   
            lcddev.wramcmd = 0X2C00;   
            lcddev.setxcmd = 0X2A00;   
            lcddev.setycmd = 0X2B00;   
            lcddev.width = 480;   
            lcddev.height = 800;   
        }   
        else   
        {   
            lcddev.wramcmd = R34;   
            lcddev.setxcmd = R32;   
            lcddev.setycmd = R33;   
        }   
    }   
    else                //横屏   
    {   
        lcddev.dir = 1; //横屏   
        lcddev.width = 320;   
        lcddev.height = 240;   
        if(lcddev.id == 0X9341 || lcddev.id == 0X5310)   
        {   
            lcddev.wramcmd = 0X2C;   
            lcddev.setxcmd = 0X2A;   
            lcddev.setycmd = 0X2B;   
        }   
        else if(lcddev.id == 0X6804)   
        {   
            lcddev.wramcmd = 0X2C;   
            lcddev.setxcmd = 0X2B;   
            lcddev.setycmd = 0X2A;   
        }   
        else if(lcddev.id == 0x5510)   
        {   
            lcddev.wramcmd = 0X2C00;   
            lcddev.setxcmd = 0X2A00;   
            lcddev.setycmd = 0X2B00;   
            lcddev.width = 800;   
            lcddev.height = 480;   
        }   
        else   
        {   
            lcddev.wramcmd = R34;   
            lcddev.setxcmd = R33;   
            lcddev.setycmd = R32;   
        }   
        if(lcddev.id == 0X6804 || lcddev.id == 0X5310)   
        {   
            lcddev.width = 480;   
            lcddev.height = 320;   
        }   
    }   
    LCD_Scan_Dir(DFT_SCAN_DIR); //默认扫描方向   
}   
 //清屏函数   
//color:要清屏的填充色   
void LCD_Clear(u16 color)   
{   
    u32 index = 0;   
    u32 totalpoint = lcddev.width;   
    totalpoint *= lcddev.height;            //得到总点数   
    if((lcddev.id == 0X6804) && (lcddev.dir == 1)) //6804横屏的时候特殊处理   
    {   
        lcddev.dir = 0;   
        lcddev.setxcmd = 0X2A;   
        lcddev.setycmd = 0X2B;   
        LCD_SetCursor(0x00, 0x0000);        //设置光标位置   
        lcddev.dir = 1;   
        lcddev.setxcmd = 0X2B;   
        lcddev.setycmd = 0X2A;   
    }   
    else LCD_SetCursor(0x00, 0x0000);   //设置光标位置   
    LCD_WriteRAM_Prepare();             //开始写入GRAM   
    for(index = 0; index < totalpoint; index++)   
    {   
        LCD->LCD_RAM = color;   
    }   
}   
//初始化lcd   
//该初始化函数可以初始化各种ILI93XX液晶,但是其他函数是基于ILI9320的!!!   
//在其他型号的驱动芯片上没有测试!   
void LCD_Init(void)   
{   
    vu32 i = 0;   
   
	GPIO_InitTypeDef  GPIO_InitStructure;
	FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
	FSMC_NORSRAMTimingInitTypeDef  readWriteTiming; 
	FSMC_NORSRAMTimingInitTypeDef  writeTiming;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB|RCC_AHB1Periph_GPIOD|RCC_AHB1Periph_GPIOE, ENABLE);//使能IO时钟  
	RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC,ENABLE);//使能FSMC时钟  
	
 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;//PB1 推挽输出,控制背光
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;//普通输出模式
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//100MHz
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
	GPIO_Init(GPIOB, &GPIO_InitStructure);//初始化 //PB15 推挽输出,控制背光
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_7|GPIO_Pin_8
																|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;//PD0,1,4,5,8,9,10,14,15 AF OUT
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用输出
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
	GPIO_Init(GPIOD, &GPIO_InitStructure);//初始化  
	
