SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12
																|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;//PE7~15,AF OUT
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用输出
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
	GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化  


	GPIO_PinAFConfig(GPIOD,GPIO_PinSource0,GPIO_AF_FSMC);// 
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource1,GPIO_AF_FSMC);// 
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource4,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource5,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource7,GPIO_AF_FSMC); //和ZET6芯片差异	
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource8,GPIO_AF_FSMC); 
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource9,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource10,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource13,GPIO_AF_FSMC);//和ZET6芯片差异	
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource14,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource15,GPIO_AF_FSMC);// 
 
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource7,GPIO_AF_FSMC);//PE7,AF12
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource8,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource9,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource10,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource11,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource12,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource13,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource14,GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE,GPIO_PinSource15,GPIO_AF_FSMC);//PE15,AF12
 
//  GPIO_PinAFConfig(GPIOF,GPIO_PinSource12,GPIO_AF_FSMC);//PF12,AF12
//  GPIO_PinAFConfig(GPIOG,GPIO_PinSource12,GPIO_AF_FSMC);


	readWriteTiming.FSMC_AddressSetupTime = 0XF;	 //地址建立时间（ADDSET）为16个HCLK 1/168M=6ns*16=96ns	
	readWriteTiming.FSMC_AddressHoldTime = 0x00;	 //地址保持时间（ADDHLD）模式A未用到	
	readWriteTiming.FSMC_DataSetupTime = 60;			//数据保存时间为60个HCLK	=6*60=360ns
	readWriteTiming.FSMC_BusTurnAroundDuration = 0x00;
	readWriteTiming.FSMC_CLKDivision = 0x00;
	readWriteTiming.FSMC_DataLatency = 0x00;
	readWriteTiming.FSMC_AccessMode = FSMC_AccessMode_A;	 //模式A 
    

	writeTiming.FSMC_AddressSetupTime =9;	      //地址建立时间（ADDSET）为9个HCLK =54ns 
	writeTiming.FSMC_AddressHoldTime = 0x00;	 //地址保持时间（A		
	writeTiming.FSMC_DataSetupTime = 8;		 //数据保存时间为6ns*9个HCLK=54ns
	writeTiming.FSMC_BusTurnAroundDuration = 0x00;
	writeTiming.FSMC_CLKDivision = 0x00;
	writeTiming.FSMC_DataLatency = 0x00;
	writeTiming.FSMC_AccessMode = FSMC_AccessMode_A;	 //模式A 

 
	FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM1;//  这里我们使用NE1 
	FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable; // 不复用数据地址
	FSMC_NORSRAMInitStructure.FSMC_MemoryType =FSMC_MemoryType_SRAM;// FSMC_MemoryType_SRAM;  //SRAM   
	FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;//存储器数据宽度为16bit   
	FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode =FSMC_BurstAccessMode_Disable;// FSMC_BurstAccessMode_Disable; 
	FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
	FSMC_NORSRAMInitStructure.FSMC_AsynchronousWait=FSMC_AsynchronousWait_Disable; 
	FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;   
	FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;  
	FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;	//  存储器写使能
	FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;   
	FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Enable; // 读写使用不同的时序
	FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Disable; 
	FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &readWriteTiming; //读写时序
	FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &writeTiming;  //写时序

	FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);  //初始化FSMC配置

	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);  // 使能BANK1   
   
    delay_ms(50); // delay 50 ms   
    LCD_WriteReg(0x0000, 0x0001);   
    delay_ms(50); // delay 50 ms   
    lcddev.id = LCD_ReadReg(0x0000);   
    if(lcddev.id < 0XFF || lcddev.id == 0XFFFF || lcddev.id == 0X9300) //读到ID不正确,新增lcddev.id==0X9300判断，因为9341在未被复位的情况下会被读成9300   
    {   
        //尝试9341 ID的读取   
        LCD_WR_REG(0XD3);   
        lcddev.id = LCD_RD_DATA();  //dummy read   
        lcddev.id = LCD_RD_DATA();  //读到0X00   
        lcddev.id = LCD_RD_DATA();      //读取93   
        lcddev.id <<= 8;   
        lcddev.id |= LCD_RD_DATA();     //读取41   
        if(lcddev.id != 0X9341)     //非9341,尝试是不是6804   
        {   
            LCD_WR_REG(0XBF);   
            lcddev.id = LCD_RD_DATA(); //dummy read   
            lcddev.id = LCD_RD_DATA(); //读回0X01   
            lcddev.id = LCD_RD_DATA(); //读回0XD0   
            lcddev.id = LCD_RD_DATA(); //这里读回0X68   
            lcddev.id <<= 8;   
            lcddev.id |= LCD_RD_DATA(); //这里读回0X04   
            if(lcddev.id != 0X6804) //也不是6804,尝试看看是不是NT35310   
            {   
                LCD_WR_REG(0XD4);   
                lcddev.id = LCD_RD_DATA();  //dummy read   
                lcddev.id = LCD_RD_DATA();  //读回0X01   
                lcddev.id = LCD_RD_DATA();  //读回0X53   
                lcddev.id <<= 8;   
                lcddev.id |= LCD_RD_DATA(); //这里读回0X10   
                if(lcddev.id != 0X5310)     //也不是NT35310,尝试看看是不是NT35510   
                {   
                    LCD_WR_REG(0XDA00);   
                    lcddev.id = LCD_RD_DATA(); //读回0X00   
                    LCD_WR_REG(0XDB00);   
                    lcddev.id = LCD_RD_DATA(); //读回0X80   
                    lcddev.id <<= 8;   
                    LCD_WR_REG(0XDC00);   
                    lcddev.id |= LCD_RD_DATA(); //读回0X00   
                    if(lcddev.id == 0x8000)lcddev.id = 0x5510; //NT35510读回的ID是8000H,为方便区分,我们强制设置为5510   
                }   
            }   
        }   
    }   
    if(lcddev.id == 0X9341 || lcddev.id == 0X5310 || lcddev.id == 0X5510) //如果是这三个IC,则设置WR时序为最快   
    {   
        //重新配置写时序控制寄存器的时序   
        FSMC_Bank1E->BWTR[6] &= ~(0XF << 0); //地址建立时间（ADDSET）清零   
        FSMC_Bank1E->BWTR[6] &= ~(0XF << 8); //数据保存时间清零   
        FSMC_Bank1E->BWTR[6] |= 3 << 0;        //地址建立时间（ADDSET）为3个HCLK =18ns   
        FSMC_Bank1E->BWTR[6] |= 2 << 8;    //数据保存时间为6ns*3个HCLK=18ns   
    }   
    else if(lcddev.id == 0X6804 || lcddev.id == 0XC505) //6804/C505速度上不去,得降低   
    {   
        //重新配置写时序控制寄存器的时序   
        FSMC_Bank1E->BWTR[6] &= ~(0XF << 0); //地址建立时间（ADDSET）清零   
        FSMC_Bank1E->BWTR[6] &= ~(0XF << 8); //数据保存时间清零   
        FSMC_Bank1E->BWTR[6] |= 10 << 0;   //地址建立时间（ADDSET）为10个HCLK =60ns   
        FSMC_Bank1E->BWTR[6] |= 12 << 8;   //数据保存时间为6ns*13个HCLK=96ns   
    }   
    //printf(" LCD ID:%x\r\n", lcddev.id); //打印LCD ID   
    if(lcddev.id == 0X9341) //9341初始化   
    {   
        LCD_WR_REG(0xCF);   
        LCD_WR_DATA(0x00);   
        i++;   
        LCD_WR_DATA(0xC1);   
        LCD_WR_DATA(0X30);   
        LCD_WR_REG(0xED);   
        LCD_WR_DATA(0x64);   
        LCD_WR_DATA(0x03);   
        LCD_WR_DATA(0X12);   
        LCD_WR_DATA(0X81);   
        LCD_WR_REG(0xE8);   
        LCD_WR_DATA(0x85);   
        LCD_WR_DATA(0x10);   
        LCD_WR_DATA(0x7A);   
        LCD_WR_REG(0xCB);   
        LCD_WR_DATA(0x39);   
        LCD_WR_DATA(0x2C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x34);   
        LCD_WR_DATA(0x02);   
        LCD_WR_REG(0xF7);   
        LCD_WR_DATA(0x20);   
        LCD_WR_REG(0xEA);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_REG(0xC0);    //Power control   
        LCD_WR_DATA(0x1B);   //VRH[5:0]   
        LCD_WR_REG(0xC1);    //Power control   
        LCD_WR_DATA(0x01);   //SAP[2:0];BT[3:0]   
        LCD_WR_REG(0xC5);    //VCM control   
        LCD_WR_DATA(0x30);   //3F   
        LCD_WR_DATA(0x30);   //3C   
        LCD_WR_REG(0xC7);    //VCM control2   
        LCD_WR_DATA(0XB7);   
        LCD_WR_REG(0x36);    // Memory Access Control   
        LCD_WR_DATA(0x48);   
        LCD_WR_REG(0x3A);   
        LCD_WR_DATA(0x55);   
        LCD_WR_REG(0xB1);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x1A);   
        LCD_WR_REG(0xB6);    // Display Function Control   
        LCD_WR_DATA(0x0A);   
        LCD_WR_DATA(0xA2);   
        LCD_WR_REG(0xF2);    // 3Gamma Function Disable   
        LCD_WR_DATA(0x00);   
        LCD_WR_REG(0x26);    //Gamma curve selected   
        LCD_WR_DATA(0x01);   
        LCD_WR_REG(0xE0);    //Set Gamma   
        LCD_WR_DATA(0x0F);   
        LCD_WR_DATA(0x2A);   
        LCD_WR_DATA(0x28);   
        LCD_WR_DATA(0x08);   
        LCD_WR_DATA(0x0E);   
        LCD_WR_DATA(0x08);   
        LCD_WR_DATA(0x54);   
        LCD_WR_DATA(0XA9);   
        LCD_WR_DATA(0x43);   
        LCD_WR_DATA(0x0A);   
        LCD_WR_DATA(0x0F);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_REG(0XE1);    //Set Gamma   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x15);   
        LCD_WR_DATA(0x17);   
        LCD_WR_DATA(0x07);   
        LCD_WR_DATA(0x11);   
        LCD_WR_DATA(0x06);   
        LCD_WR_DATA(0x2B);   
        LCD_WR_DATA(0x56);   
        LCD_WR_DATA(0x3C);   
        LCD_WR_DATA(0x05);   
        LCD_WR_DATA(0x10);   
        LCD_WR_DATA(0x0F);   
        LCD_WR_DATA(0x3F);   
        LCD_WR_DATA(0x3F);   
        LCD_WR_DATA(0x0F);   
        LCD_WR_REG(0x2B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x01);   
        LCD_WR_DATA(0x3f);   
        LCD_WR_REG(0x2A);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xef);   
        LCD_WR_REG(0x11); //Exit Sleep   
        delay_ms(120);   
        LCD_WR_REG(0x29); //display on   
    }   
    else if(lcddev.id == 0x6804) //6804初始化   
    {   
        LCD_WR_REG(0X11);   
        delay_ms(20);   
        LCD_WR_REG(0XD0);//VCI1  VCL  VGH  VGL DDVDH VREG1OUT power amplitude setting   
        LCD_WR_DATA(0X07);   
        LCD_WR_DATA(0X42);   
        LCD_WR_DATA(0X1D);   
        LCD_WR_REG(0XD1);//VCOMH VCOM_AC amplitude setting   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X1a);   
        LCD_WR_DATA(0X09);   
        LCD_WR_REG(0XD2);//Operational Amplifier Circuit Constant Current Adjust , charge pump frequency setting   
        LCD_WR_DATA(0X01);   
        LCD_WR_DATA(0X22);   
        LCD_WR_REG(0XC0);//REV SM GS   
        LCD_WR_DATA(0X10);   
        LCD_WR_DATA(0X3B);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X02);   
        LCD_WR_DATA(0X11);   
   
        LCD_WR_REG(0XC5);// Frame rate setting = 72HZ  when setting 0x03   
        LCD_WR_DATA(0X03);   
   
