SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
        LCD_WR_REG(0XC8);//Gamma setting   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X25);   
        LCD_WR_DATA(0X21);   
        LCD_WR_DATA(0X05);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X0a);   
        LCD_WR_DATA(0X65);   
        LCD_WR_DATA(0X25);   
        LCD_WR_DATA(0X77);   
        LCD_WR_DATA(0X50);   
        LCD_WR_DATA(0X0f);   
        LCD_WR_DATA(0X00);   
   
        LCD_WR_REG(0XF8);   
        LCD_WR_DATA(0X01);   
   
        LCD_WR_REG(0XFE);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X02);   
   
        LCD_WR_REG(0X20);//Exit invert mode   
   
        LCD_WR_REG(0X36);   
        LCD_WR_DATA(0X08);//原来是a   
   
        LCD_WR_REG(0X3A);   
        LCD_WR_DATA(0X55);//16位模式   
        LCD_WR_REG(0X2B);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X01);   
        LCD_WR_DATA(0X3F);   
   
        LCD_WR_REG(0X2A);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X00);   
        LCD_WR_DATA(0X01);   
        LCD_WR_DATA(0XDF);   
        delay_ms(120);   
        LCD_WR_REG(0X29);   
    }   
    else if(lcddev.id == 0x5310)   
    {   
        LCD_WR_REG(0xED);   
        LCD_WR_DATA(0x01);   
        LCD_WR_DATA(0xFE);   
   
        LCD_WR_REG(0xEE);   
        LCD_WR_DATA(0xDE);   
        LCD_WR_DATA(0x21);   
   
        LCD_WR_REG(0xF1);   
        LCD_WR_DATA(0x01);   
        LCD_WR_REG(0xDF);   
        LCD_WR_DATA(0x10);   
   
        //VCOMvoltage//   
        LCD_WR_REG(0xC4);   
        LCD_WR_DATA(0x8F);    //5f   
   
        LCD_WR_REG(0xC6);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xE2);   
        LCD_WR_DATA(0xE2);   
        LCD_WR_DATA(0xE2);   
        LCD_WR_REG(0xBF);   
        LCD_WR_DATA(0xAA);   
   
        LCD_WR_REG(0xB0);   
        LCD_WR_DATA(0x0D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x0D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x11);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x19);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x21);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x2D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x5D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x5D);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB1);   
        LCD_WR_DATA(0x80);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x8B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x96);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x02);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x03);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB4);   
        LCD_WR_DATA(0x8B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x96);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA1);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB5);   
        LCD_WR_DATA(0x02);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x03);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x04);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB6);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB7);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3F);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x5E);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x64);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x8C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xAC);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xDC);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x70);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x90);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xEB);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xDC);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xB8);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xBA);   
        LCD_WR_DATA(0x24);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC1);   
        LCD_WR_DATA(0x20);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x54);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xFF);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC2);   
        LCD_WR_DATA(0x0A);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x04);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC3);   
        LCD_WR_DATA(0x3C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3A);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x39);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x37);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x36);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x32);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x2F);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x2C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x29);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x26);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x24);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x24);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x23);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x36);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x32);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x2F);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x2C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x29);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x26);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x24);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x24);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x23);   
        LCD_WR_DATA(0x00);   
   
