SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
        LCD_WR_REG(0xC4);   
        LCD_WR_DATA(0x62);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x05);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x84);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF0);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x18);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA4);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x18);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x50);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x0C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x17);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x95);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xE6);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC5);   
        LCD_WR_DATA(0x32);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x65);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x76);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x88);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC6);   
        LCD_WR_DATA(0x20);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x17);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x01);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC7);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC8);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xC9);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE0);   
        LCD_WR_DATA(0x16);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x1C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x21);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x36);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x46);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x52);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x64);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x7A);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x8B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA8);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xB9);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC4);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xCA);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD9);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xE0);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE1);   
        LCD_WR_DATA(0x16);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x1C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x22);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x36);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x45);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x52);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x64);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x7A);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x8B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA8);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xB9);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC4);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xCA);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD8);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xE0);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE2);   
        LCD_WR_DATA(0x05);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x0B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x1B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x34);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x4F);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x61);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x79);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x88);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x97);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA6);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xB7);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC7);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD1);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD6);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xDD);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_REG(0xE3);   
        LCD_WR_DATA(0x05);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x1C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x33);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x50);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x62);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x78);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x88);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x97);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA6);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xB7);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC7);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD1);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD5);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xDD);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
   
