SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
        LCD_WR_REG(0xE4);   
        LCD_WR_DATA(0x01);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x01);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x02);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x2A);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x4B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x5D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x74);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x84);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x93);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xB3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xBE);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC4);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xCD);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xDD);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_REG(0xE5);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x02);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x29);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x3C);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x4B);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x5D);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x74);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x84);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x93);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xA2);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xB3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xBE);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xC4);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xCD);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xD3);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xDC);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xF3);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE6);   
        LCD_WR_DATA(0x11);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x34);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x56);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x76);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x77);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x66);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x88);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xBB);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x66);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x55);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x55);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x45);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x43);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE7);   
        LCD_WR_DATA(0x32);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x55);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x76);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x66);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x67);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x67);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x87);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xBB);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x77);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x56);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x23);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x33);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x45);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE8);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x87);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x88);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x77);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x66);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x88);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xAA);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0xBB);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x99);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x66);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x55);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x55);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x44);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x55);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xE9);   
        LCD_WR_DATA(0xAA);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0x00);   
        LCD_WR_DATA(0xAA);   
   
        LCD_WR_REG(0xCF);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xF0);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x50);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xF3);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0xF9);   
        LCD_WR_DATA(0x06);   
        LCD_WR_DATA(0x10);   
        LCD_WR_DATA(0x29);   
        LCD_WR_DATA(0x00);   
   
        LCD_WR_REG(0x3A);   
        LCD_WR_DATA(0x55);  //66   
   
