SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
        LCD_WriteReg(0xD30B, 0x81);   
        LCD_WriteReg(0xD30C, 0x00);   
        LCD_WriteReg(0xD30D, 0xA6);   
        LCD_WriteReg(0xD30E, 0x00);   
        LCD_WriteReg(0xD30F, 0xE5);   
        LCD_WriteReg(0xD310, 0x01);   
        LCD_WriteReg(0xD311, 0x13);   
        LCD_WriteReg(0xD312, 0x01);   
        LCD_WriteReg(0xD313, 0x54);   
        LCD_WriteReg(0xD314, 0x01);   
        LCD_WriteReg(0xD315, 0x82);   
        LCD_WriteReg(0xD316, 0x01);   
        LCD_WriteReg(0xD317, 0xCA);   
        LCD_WriteReg(0xD318, 0x02);   
        LCD_WriteReg(0xD319, 0x00);   
        LCD_WriteReg(0xD31A, 0x02);   
        LCD_WriteReg(0xD31B, 0x01);   
        LCD_WriteReg(0xD31C, 0x02);   
        LCD_WriteReg(0xD31D, 0x34);   
        LCD_WriteReg(0xD31E, 0x02);   
        LCD_WriteReg(0xD31F, 0x67);   
        LCD_WriteReg(0xD320, 0x02);   
        LCD_WriteReg(0xD321, 0x84);   
        LCD_WriteReg(0xD322, 0x02);   
        LCD_WriteReg(0xD323, 0xA4);   
        LCD_WriteReg(0xD324, 0x02);   
        LCD_WriteReg(0xD325, 0xB7);   
        LCD_WriteReg(0xD326, 0x02);   
        LCD_WriteReg(0xD327, 0xCF);   
        LCD_WriteReg(0xD328, 0x02);   
        LCD_WriteReg(0xD329, 0xDE);   
        LCD_WriteReg(0xD32A, 0x02);   
        LCD_WriteReg(0xD32B, 0xF2);   
        LCD_WriteReg(0xD32C, 0x02);   
        LCD_WriteReg(0xD32D, 0xFE);   
        LCD_WriteReg(0xD32E, 0x03);   
        LCD_WriteReg(0xD32F, 0x10);   
        LCD_WriteReg(0xD330, 0x03);   
        LCD_WriteReg(0xD331, 0x33);   
        LCD_WriteReg(0xD332, 0x03);   
        LCD_WriteReg(0xD333, 0x6D);   
        LCD_WriteReg(0xD400, 0x00);   
        LCD_WriteReg(0xD401, 0x33);   
        LCD_WriteReg(0xD402, 0x00);   
        LCD_WriteReg(0xD403, 0x34);   
        LCD_WriteReg(0xD404, 0x00);   
        LCD_WriteReg(0xD405, 0x3A);   
        LCD_WriteReg(0xD406, 0x00);   
        LCD_WriteReg(0xD407, 0x4A);   
        LCD_WriteReg(0xD408, 0x00);   
        LCD_WriteReg(0xD409, 0x5C);   
        LCD_WriteReg(0xD40A, 0x00);   
        LCD_WriteReg(0xD40B, 0x81);   
   
        LCD_WriteReg(0xD40C, 0x00);   
        LCD_WriteReg(0xD40D, 0xA6);   
        LCD_WriteReg(0xD40E, 0x00);   
        LCD_WriteReg(0xD40F, 0xE5);   
        LCD_WriteReg(0xD410, 0x01);   
        LCD_WriteReg(0xD411, 0x13);   
        LCD_WriteReg(0xD412, 0x01);   
        LCD_WriteReg(0xD413, 0x54);   
        LCD_WriteReg(0xD414, 0x01);   
        LCD_WriteReg(0xD415, 0x82);   
        LCD_WriteReg(0xD416, 0x01);   
        LCD_WriteReg(0xD417, 0xCA);   
        LCD_WriteReg(0xD418, 0x02);   
        LCD_WriteReg(0xD419, 0x00);   
        LCD_WriteReg(0xD41A, 0x02);   
        LCD_WriteReg(0xD41B, 0x01);   
        LCD_WriteReg(0xD41C, 0x02);   
        LCD_WriteReg(0xD41D, 0x34);   
        LCD_WriteReg(0xD41E, 0x02);   
        LCD_WriteReg(0xD41F, 0x67);   
        LCD_WriteReg(0xD420, 0x02);   
        LCD_WriteReg(0xD421, 0x84);   
        LCD_WriteReg(0xD422, 0x02);   
        LCD_WriteReg(0xD423, 0xA4);   
        LCD_WriteReg(0xD424, 0x02);   
        LCD_WriteReg(0xD425, 0xB7);   
        LCD_WriteReg(0xD426, 0x02);   
        LCD_WriteReg(0xD427, 0xCF);   
        LCD_WriteReg(0xD428, 0x02);   
        LCD_WriteReg(0xD429, 0xDE);   
        LCD_WriteReg(0xD42A, 0x02);   
        LCD_WriteReg(0xD42B, 0xF2);   
        LCD_WriteReg(0xD42C, 0x02);   
        LCD_WriteReg(0xD42D, 0xFE);   
        LCD_WriteReg(0xD42E, 0x03);   
        LCD_WriteReg(0xD42F, 0x10);   
        LCD_WriteReg(0xD430, 0x03);   
        LCD_WriteReg(0xD431, 0x33);   
        LCD_WriteReg(0xD432, 0x03);   
        LCD_WriteReg(0xD433, 0x6D);   
        LCD_WriteReg(0xD500, 0x00);   
        LCD_WriteReg(0xD501, 0x33);   
        LCD_WriteReg(0xD502, 0x00);   
        LCD_WriteReg(0xD503, 0x34);   
        LCD_WriteReg(0xD504, 0x00);   
        LCD_WriteReg(0xD505, 0x3A);   
        LCD_WriteReg(0xD506, 0x00);   
        LCD_WriteReg(0xD507, 0x4A);   
        LCD_WriteReg(0xD508, 0x00);   
        LCD_WriteReg(0xD509, 0x5C);   
        LCD_WriteReg(0xD50A, 0x00);   
        LCD_WriteReg(0xD50B, 0x81);   
   
        LCD_WriteReg(0xD50C, 0x00);   
        LCD_WriteReg(0xD50D, 0xA6);   
        LCD_WriteReg(0xD50E, 0x00);   
        LCD_WriteReg(0xD50F, 0xE5);   
        LCD_WriteReg(0xD510, 0x01);   
        LCD_WriteReg(0xD511, 0x13);   
        LCD_WriteReg(0xD512, 0x01);   
        LCD_WriteReg(0xD513, 0x54);   
        LCD_WriteReg(0xD514, 0x01);   
        LCD_WriteReg(0xD515, 0x82);   
        LCD_WriteReg(0xD516, 0x01);   
        LCD_WriteReg(0xD517, 0xCA);   
        LCD_WriteReg(0xD518, 0x02);   
        LCD_WriteReg(0xD519, 0x00);   
        LCD_WriteReg(0xD51A, 0x02);   
        LCD_WriteReg(0xD51B, 0x01);   
        LCD_WriteReg(0xD51C, 0x02);   
        LCD_WriteReg(0xD51D, 0x34);   
        LCD_WriteReg(0xD51E, 0x02);   
        LCD_WriteReg(0xD51F, 0x67);   
        LCD_WriteReg(0xD520, 0x02);   
        LCD_WriteReg(0xD521, 0x84);   
        LCD_WriteReg(0xD522, 0x02);   
        LCD_WriteReg(0xD523, 0xA4);   
        LCD_WriteReg(0xD524, 0x02);   
        LCD_WriteReg(0xD525, 0xB7);   
        LCD_WriteReg(0xD526, 0x02);   
        LCD_WriteReg(0xD527, 0xCF);   
        LCD_WriteReg(0xD528, 0x02);   
        LCD_WriteReg(0xD529, 0xDE);   
        LCD_WriteReg(0xD52A, 0x02);   
        LCD_WriteReg(0xD52B, 0xF2);   
        LCD_WriteReg(0xD52C, 0x02);   
        LCD_WriteReg(0xD52D, 0xFE);   
        LCD_WriteReg(0xD52E, 0x03);   
        LCD_WriteReg(0xD52F, 0x10);   
        LCD_WriteReg(0xD530, 0x03);   
        LCD_WriteReg(0xD531, 0x33);   
        LCD_WriteReg(0xD532, 0x03);   
        LCD_WriteReg(0xD533, 0x6D);   
        LCD_WriteReg(0xD600, 0x00);   
        LCD_WriteReg(0xD601, 0x33);   
        LCD_WriteReg(0xD602, 0x00);   
        LCD_WriteReg(0xD603, 0x34);   
        LCD_WriteReg(0xD604, 0x00);   
        LCD_WriteReg(0xD605, 0x3A);   
        LCD_WriteReg(0xD606, 0x00);   
        LCD_WriteReg(0xD607, 0x4A);   
        LCD_WriteReg(0xD608, 0x00);   
        LCD_WriteReg(0xD609, 0x5C);   
        LCD_WriteReg(0xD60A, 0x00);   
        LCD_WriteReg(0xD60B, 0x81);   
   
        LCD_WriteReg(0xD60C, 0x00);   
        LCD_WriteReg(0xD60D, 0xA6);   
        LCD_WriteReg(0xD60E, 0x00);   
        LCD_WriteReg(0xD60F, 0xE5);   
        LCD_WriteReg(0xD610, 0x01);   
        LCD_WriteReg(0xD611, 0x13);   
        LCD_WriteReg(0xD612, 0x01);   
        LCD_WriteReg(0xD613, 0x54);   
        LCD_WriteReg(0xD614, 0x01);   
        LCD_WriteReg(0xD615, 0x82);   
        LCD_WriteReg(0xD616, 0x01);   
        LCD_WriteReg(0xD617, 0xCA);   
        LCD_WriteReg(0xD618, 0x02);   
        LCD_WriteReg(0xD619, 0x00);   
        LCD_WriteReg(0xD61A, 0x02);   
        LCD_WriteReg(0xD61B, 0x01);   
        LCD_WriteReg(0xD61C, 0x02);   
        LCD_WriteReg(0xD61D, 0x34);   
        LCD_WriteReg(0xD61E, 0x02);   
        LCD_WriteReg(0xD61F, 0x67);   
        LCD_WriteReg(0xD620, 0x02);   
        LCD_WriteReg(0xD621, 0x84);   
        LCD_WriteReg(0xD622, 0x02);   
        LCD_WriteReg(0xD623, 0xA4);   
        LCD_WriteReg(0xD624, 0x02);   
        LCD_WriteReg(0xD625, 0xB7);   
        LCD_WriteReg(0xD626, 0x02);   
        LCD_WriteReg(0xD627, 0xCF);   
        LCD_WriteReg(0xD628, 0x02);   
        LCD_WriteReg(0xD629, 0xDE);   
        LCD_WriteReg(0xD62A, 0x02);   
        LCD_WriteReg(0xD62B, 0xF2);   
        LCD_WriteReg(0xD62C, 0x02);   
        LCD_WriteReg(0xD62D, 0xFE);   
        LCD_WriteReg(0xD62E, 0x03);   
        LCD_WriteReg(0xD62F, 0x10);   
        LCD_WriteReg(0xD630, 0x03);   
        LCD_WriteReg(0xD631, 0x33);   
        LCD_WriteReg(0xD632, 0x03);   
        LCD_WriteReg(0xD633, 0x6D);   
        //LV2 Page 0 enable   
        LCD_WriteReg(0xF000, 0x55);   
        LCD_WriteReg(0xF001, 0xAA);   
        LCD_WriteReg(0xF002, 0x52);   
        LCD_WriteReg(0xF003, 0x08);   
        LCD_WriteReg(0xF004, 0x00);   
        //Display control   
        LCD_WriteReg(0xB100, 0xCC);   
        LCD_WriteReg(0xB101, 0x00);   
        //Source hold time   
        LCD_WriteReg(0xB600, 0x05);   
        //Gate EQ control   
        LCD_WriteReg(0xB700, 0x70);   
        LCD_WriteReg(0xB701, 0x70);   
        //Source EQ control (Mode 2)   
        LCD_WriteReg(0xB800, 0x01);   
        LCD_WriteReg(0xB801, 0x03);   
        LCD_WriteReg(0xB802, 0x03);   
        LCD_WriteReg(0xB803, 0x03);   
        //Inversion mode (2-dot)   
        LCD_WriteReg(0xBC00, 0x02);   
        LCD_WriteReg(0xBC01, 0x00);   
        LCD_WriteReg(0xBC02, 0x00);   
        //Timing control 4H w/ 4-delay   
        LCD_WriteReg(0xC900, 0xD0);   
        LCD_WriteReg(0xC901, 0x02);   
        LCD_WriteReg(0xC902, 0x50);   
        LCD_WriteReg(0xC903, 0x50);   
        LCD_WriteReg(0xC904, 0x50);   
        LCD_WriteReg(0x3500, 0x00);   
        LCD_WriteReg(0x3A00, 0x55); //16-bit/pixel   
        LCD_WR_REG(0x1100);   
        delay_us(120);   
          
        LCD_WR_REG(0x2900);   
    }   
    else if(lcddev.id == 0x9325) //9325   
    {   
        LCD_WriteReg(0x00E5, 0x78F0);   
        LCD_WriteReg(0x0001, 0x0100);   
        LCD_WriteReg(0x0002, 0x0700);   
        LCD_WriteReg(0x0003, 0x1030);   
        LCD_WriteReg(0x0004, 0x0000);   
        LCD_WriteReg(0x0008, 0x0202);   
        LCD_WriteReg(0x0009, 0x0000);   
        LCD_WriteReg(0x000A, 0x0000);   
        LCD_WriteReg(0x000C, 0x0000);   
        LCD_WriteReg(0x000D, 0x0000);   
        LCD_WriteReg(0x000F, 0x0000);   
        //power on sequence VGHVGL   
        LCD_WriteReg(0x0010, 0x0000);   
        LCD_WriteReg(0x0011, 0x0007);   
        LCD_WriteReg(0x0012, 0x0000);   
        LCD_WriteReg(0x0013, 0x0000);   
        LCD_WriteReg(0x0007, 0x0000);   
        //vgh   
        LCD_WriteReg(0x0010, 0x1690);   
        LCD_WriteReg(0x0011, 0x0227);   
        //delayms(100);   
        //vregiout   
        LCD_WriteReg(0x0012, 0x009D); //0x001b   
        //delayms(100);   
        //vom amplitude   
        LCD_WriteReg(0x0013, 0x1900);   
        //delayms(100);   
        //vom H   
        LCD_WriteReg(0x0029, 0x0025);   
        LCD_WriteReg(0x002B, 0x000D);   
        //gamma   
        LCD_WriteReg(0x0030, 0x0007);   
        LCD_WriteReg(0x0031, 0x0303);   
        LCD_WriteReg(0x0032, 0x0003); // 0006   
        LCD_WriteReg(0x0035, 0x0206);   
        LCD_WriteReg(0x0036, 0x0008);   
        LCD_WriteReg(0x0037, 0x0406);   
        LCD_WriteReg(0x0038, 0x0304); //0200   
        LCD_WriteReg(0x0039, 0x0007);   
        LCD_WriteReg(0x003C, 0x0602); // 0504   
        LCD_WriteReg(0x003D, 0x0008);   
        //ram   
        LCD_WriteReg(0x0050, 0x0000);   
        LCD_WriteReg(0x0051, 0x00EF);   
        LCD_WriteReg(0x0052, 0x0000);   
        LCD_WriteReg(0x0053, 0x013F);   
        LCD_WriteReg(0x0060, 0xA700);   
        LCD_WriteReg(0x0061, 0x0001);   
        LCD_WriteReg(0x006A, 0x0000);   
        //   
        LCD_WriteReg(0x0080, 0x0000);   
        LCD_WriteReg(0x0081, 0x0000);   
        LCD_WriteReg(0x0082, 0x0000);   
        LCD_WriteReg(0x0083, 0x0000);   
        LCD_WriteReg(0x0084, 0x0000);   
        LCD_WriteReg(0x0085, 0x0000);   
        //   
        LCD_WriteReg(0x0090, 0x0010);   
        LCD_WriteReg(0x0092, 0x0600);   
   
        LCD_WriteReg(0x0007, 0x0133);   
        LCD_WriteReg(0x00, 0x0022); //   
    }   
    else if(lcddev.id == 0x9328) //ILI9328   OK   
    {   
        LCD_WriteReg(0x00EC, 0x108F); // internal timeing   
        LCD_WriteReg(0x00EF, 0x1234); // ADD   
        //LCD_WriteReg(0x00e7,0x0010);   
        //LCD_WriteReg(0x0000,0x0001);//开启内部时钟   
        LCD_WriteReg(0x0001, 0x0100);   
        LCD_WriteReg(0x0002, 0x0700); //电源开启   
        //LCD_WriteReg(0x0003,(1<<3)|(1<<4) );  //65K  RGB   
        //DRIVE TABLE(寄存器 03H)   
        //BIT3=AM BIT4:5=ID0:1   
        //AM ID0 ID1   FUNCATION   
        // 0  0   0    R->L D->U   
        // 1  0   0    D->U  R->L   
        // 0  1   0    L->R D->U   
        // 1  1   0    D->U  L->R   
        // 0  0   1    R->L U->D   
        // 1  0   1    U->D  R->L   
        // 0  1   1    L->R U->D 正常就用这个.   
        // 1  1   1    U->D  L->R   
        LCD_WriteReg(0x0003, (1 << 12) | (3 << 4) | (0 << 3) ); //65K   
        LCD_WriteReg(0x0004, 0x0000);   
        LCD_WriteReg(0x0008, 0x0202);   
        LCD_WriteReg(0x0009, 0x0000);   
        LCD_WriteReg(0x000a, 0x0000); //display setting   
        LCD_WriteReg(0x000c, 0x0001); //display setting   
        LCD_WriteReg(0x000d, 0x0000); //0f3c   
        LCD_WriteReg(0x000f, 0x0000);   
        //电源配置   
        LCD_WriteReg(0x0010, 0x0000);   
        LCD_WriteReg(0x0011, 0x0007);   
        LCD_WriteReg(0x0012, 0x0000);   
        LCD_WriteReg(0x0013, 0x0000);   
        LCD_WriteReg(0x0007, 0x0001);   
        delay_ms(50);   
        LCD_WriteReg(0x0010, 0x1490);   
        LCD_WriteReg(0x0011, 0x0227);   
        delay_ms(50);   
        LCD_WriteReg(0x0012, 0x008A);   
        delay_ms(50);   
        LCD_WriteReg(0x0013, 0x1a00);   
        LCD_WriteReg(0x0029, 0x0006);   
        LCD_WriteReg(0x002b, 0x000d);   
        delay_ms(50);   
        LCD_WriteReg(0x0020, 0x0000);   
        LCD_WriteReg(0x0021, 0x0000);   
        delay_ms(50);   
        //伽马校正   
        LCD_WriteReg(0x0030, 0x0000);   
        LCD_WriteReg(0x0031, 0x0604);   
        LCD_WriteReg(0x0032, 0x0305);   
        LCD_WriteReg(0x0035, 0x0000);   
        LCD_WriteReg(0x0036, 0x0C09);   
        LCD_WriteReg(0x0037, 0x0204);   
        LCD_WriteReg(0x0038, 0x0301);   
        LCD_WriteReg(0x0039, 0x0707);   
        LCD_WriteReg(0x003c, 0x0000);   
        LCD_WriteReg(0x003d, 0x0a0a);   
        delay_ms(50);   
        LCD_WriteReg(0x0050, 0x0000); //水平GRAM起始位置   
        LCD_WriteReg(0x0051, 0x00ef); //水平GRAM终止位置   
        LCD_WriteReg(0x0052, 0x0000); //垂直GRAM起始位置   
        LCD_WriteReg(0x0053, 0x013f); //垂直GRAM终止位置   
   
