SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
        LCD_WriteReg(0x0060, 0xa700);   
        LCD_WriteReg(0x0061, 0x0001);   
        LCD_WriteReg(0x006a, 0x0000);   
        LCD_WriteReg(0x0080, 0x0000);   
        LCD_WriteReg(0x0081, 0x0000);   
        LCD_WriteReg(0x0082, 0x0000);   
        LCD_WriteReg(0x0083, 0x0000);   
        LCD_WriteReg(0x0084, 0x0000);   
        LCD_WriteReg(0x0085, 0x0000);   
   
        LCD_WriteReg(0x0090, 0x0010);   
        LCD_WriteReg(0x0092, 0x0600);   
        //开启显示设置   
        LCD_WriteReg(0x0007, 0x0133);   
    }   
    else if(lcddev.id == 0x9320) //测试OK.   
    {   
        LCD_WriteReg(0x00, 0x0000);   
        LCD_WriteReg(0x01, 0x0100); //Driver Output Contral.   
        LCD_WriteReg(0x02, 0x0700); //LCD Driver Waveform Contral.   
        LCD_WriteReg(0x03, 0x1030); //Entry Mode Set.   
        //LCD_WriteReg(0x03,0x1018);    //Entry Mode Set.   
   
        LCD_WriteReg(0x04, 0x0000); //Scalling Contral.   
        LCD_WriteReg(0x08, 0x0202); //Display Contral 2.(0x0207)   
        LCD_WriteReg(0x09, 0x0000); //Display Contral 3.(0x0000)   
        LCD_WriteReg(0x0a, 0x0000); //Frame Cycle Contal.(0x0000)   
        LCD_WriteReg(0x0c, (1 << 0)); //Extern Display Interface Contral 1.(0x0000)   
        LCD_WriteReg(0x0d, 0x0000); //Frame Maker Position.   
        LCD_WriteReg(0x0f, 0x0000); //Extern Display Interface Contral 2.   
        delay_ms(50);   
        LCD_WriteReg(0x07, 0x0101); //Display Contral.   
        delay_ms(50);   
        LCD_WriteReg(0x10, (1 << 12) | (0 << 8) | (1 << 7) | (1 << 6) | (0 << 4));    //Power Control 1.(0x16b0)   
        LCD_WriteReg(0x11, 0x0007);                             //Power Control 2.(0x0001)   
        LCD_WriteReg(0x12, (1 << 8) | (1 << 4) | (0 << 0));               //Power Control 3.(0x0138)   
        LCD_WriteReg(0x13, 0x0b00);                             //Power Control 4.   
        LCD_WriteReg(0x29, 0x0000);                             //Power Control 7.   
   
        LCD_WriteReg(0x2b, (1 << 14) | (1 << 4));   
        LCD_WriteReg(0x50, 0);  //Set X Star   
        //水平GRAM终止位置Set X End.   
        LCD_WriteReg(0x51, 239);    //Set Y Star   
        LCD_WriteReg(0x52, 0);  //Set Y End.t.   
        LCD_WriteReg(0x53, 319);    //   
   
        LCD_WriteReg(0x60, 0x2700); //Driver Output Control.   
        LCD_WriteReg(0x61, 0x0001); //Driver Output Control.   
        LCD_WriteReg(0x6a, 0x0000); //Vertical Srcoll Control.   
   
        LCD_WriteReg(0x80, 0x0000); //Display Position? Partial Display 1.   
        LCD_WriteReg(0x81, 0x0000); //RAM Address Start? Partial Display 1.   
        LCD_WriteReg(0x82, 0x0000); //RAM Address End-Partial Display 1.   
        LCD_WriteReg(0x83, 0x0000); //Displsy Position? Partial Display 2.   
        LCD_WriteReg(0x84, 0x0000); //RAM Address Start? Partial Display 2.   
        LCD_WriteReg(0x85, 0x0000); //RAM Address End? Partial Display 2.   
   
        LCD_WriteReg(0x90, (0 << 7) | (16 << 0));   //Frame Cycle Contral.(0x0013)   
        LCD_WriteReg(0x92, 0x0000); //Panel Interface Contral 2.(0x0000)   
        LCD_WriteReg(0x93, 0x0001); //Panel Interface Contral 3.   
        LCD_WriteReg(0x95, 0x0110); //Frame Cycle Contral.(0x0110)   
        LCD_WriteReg(0x97, (0 << 8)); //   
        LCD_WriteReg(0x98, 0x0000); //Frame Cycle Contral.   
        LCD_WriteReg(0x07, 0x0173); //(0x0173)   
    }   
    else if(lcddev.id == 0X9331) //OK |/|/|   
    {   
        LCD_WriteReg(0x00E7, 0x1014);   
        LCD_WriteReg(0x0001, 0x0100); // set SS and SM bit   
        LCD_WriteReg(0x0002, 0x0200); // set 1 line inversion   
        LCD_WriteReg(0x0003, (1 << 12) | (3 << 4) | (1 << 3)); //65K   
        //LCD_WriteReg(0x0003, 0x1030); // set GRAM write direction and BGR=1.   
        LCD_WriteReg(0x0008, 0x0202); // set the back porch and front porch   
        LCD_WriteReg(0x0009, 0x0000); // set non-display area refresh cycle ISC[3:0]   
        LCD_WriteReg(0x000A, 0x0000); // FMARK function   
        LCD_WriteReg(0x000C, 0x0000); // RGB interface setting   
        LCD_WriteReg(0x000D, 0x0000); // Frame marker Position   
        LCD_WriteReg(0x000F, 0x0000); // RGB interface polarity   
        //*************Power On sequence ****************//   
        LCD_WriteReg(0x0010, 0x0000); // SAP, BT[3:0], AP, DSTB, SLP, STB   
        LCD_WriteReg(0x0011, 0x0007); // DC1[2:0], DC0[2:0], VC[2:0]   
        LCD_WriteReg(0x0012, 0x0000); // VREG1OUT voltage   
        LCD_WriteReg(0x0013, 0x0000); // VDV[4:0] for VCOM amplitude   
        delay_ms(200); // Dis-charge capacitor power voltage   
        LCD_WriteReg(0x0010, 0x1690); // SAP, BT[3:0], AP, DSTB, SLP, STB   
        LCD_WriteReg(0x0011, 0x0227); // DC1[2:0], DC0[2:0], VC[2:0]   
        delay_ms(50); // Delay 50ms   
        LCD_WriteReg(0x0012, 0x000C); // Internal reference voltage= Vci;   
        delay_ms(50); // Delay 50ms   
        LCD_WriteReg(0x0013, 0x0800); // Set VDV[4:0] for VCOM amplitude   
        LCD_WriteReg(0x0029, 0x0011); // Set VCM[5:0] for VCOMH   
        LCD_WriteReg(0x002B, 0x000B); // Set Frame Rate   
        delay_ms(50); // Delay 50ms   
        LCD_WriteReg(0x0020, 0x0000); // GRAM horizontal Address   
        LCD_WriteReg(0x0021, 0x013f); // GRAM Vertical Address   
        // ----------- Adjust the Gamma Curve ----------//   
        LCD_WriteReg(0x0030, 0x0000);   
        LCD_WriteReg(0x0031, 0x0106);   
        LCD_WriteReg(0x0032, 0x0000);   
        LCD_WriteReg(0x0035, 0x0204);   
        LCD_WriteReg(0x0036, 0x160A);   
        LCD_WriteReg(0x0037, 0x0707);   
        LCD_WriteReg(0x0038, 0x0106);   
        LCD_WriteReg(0x0039, 0x0707);   
        LCD_WriteReg(0x003C, 0x0402);   
        LCD_WriteReg(0x003D, 0x0C0F);   
        //------------------ Set GRAM area ---------------//   
        LCD_WriteReg(0x0050, 0x0000); // Horizontal GRAM Start Address   
        LCD_WriteReg(0x0051, 0x00EF); // Horizontal GRAM End Address   
        LCD_WriteReg(0x0052, 0x0000); // Vertical GRAM Start Address   
        LCD_WriteReg(0x0053, 0x013F); // Vertical GRAM Start Address   
        LCD_WriteReg(0x0060, 0x2700); // Gate Scan Line   
        LCD_WriteReg(0x0061, 0x0001); // NDL,VLE, REV   
        LCD_WriteReg(0x006A, 0x0000); // set scrolling line   
        //-------------- Partial Display Control ---------//   
        LCD_WriteReg(0x0080, 0x0000);   
        LCD_WriteReg(0x0081, 0x0000);   
        LCD_WriteReg(0x0082, 0x0000);   
        LCD_WriteReg(0x0083, 0x0000);   
        LCD_WriteReg(0x0084, 0x0000);   
        LCD_WriteReg(0x0085, 0x0000);   
        //-------------- Panel Control -------------------//   
        LCD_WriteReg(0x0090, 0x0010);   
        LCD_WriteReg(0x0092, 0x0600);   
        LCD_WriteReg(0x0007, 0x0133); // 262K color and display ON   
    }   
    else if(lcddev.id == 0x5408)   
    {   
        LCD_WriteReg(0x01, 0x0100);   
        LCD_WriteReg(0x02, 0x0700); //LCD Driving Waveform Contral   
        LCD_WriteReg(0x03, 0x1030); //Entry Mode设置   
        //指针从左至右自上而下的自动增模式   
        //Normal Mode(Window Mode disable)   
        //RGB格式   
        //16位数据2次传输的8总线设置   
        LCD_WriteReg(0x04, 0x0000); //Scalling Control register   
        LCD_WriteReg(0x08, 0x0207); //Display Control 2   
        LCD_WriteReg(0x09, 0x0000); //Display Control 3   
        LCD_WriteReg(0x0A, 0x0000); //Frame Cycle Control   
        LCD_WriteReg(0x0C, 0x0000); //External Display Interface Control 1   
        LCD_WriteReg(0x0D, 0x0000); //Frame Maker Position   
        LCD_WriteReg(0x0F, 0x0000); //External Display Interface Control 2   
        delay_ms(20);   
        //TFT 液晶彩色图像显示方法14   
        LCD_WriteReg(0x10, 0x16B0); //0x14B0 //Power Control 1   
        LCD_WriteReg(0x11, 0x0001); //0x0007 //Power Control 2   
        LCD_WriteReg(0x17, 0x0001); //0x0000 //Power Control 3   
        LCD_WriteReg(0x12, 0x0138); //0x013B //Power Control 4   
        LCD_WriteReg(0x13, 0x0800); //0x0800 //Power Control 5   
        LCD_WriteReg(0x29, 0x0009); //NVM read data 2   
        LCD_WriteReg(0x2a, 0x0009); //NVM read data 3   
        LCD_WriteReg(0xa4, 0x0000);   
        LCD_WriteReg(0x50, 0x0000); //设置操作窗口的X轴开始列   
        LCD_WriteReg(0x51, 0x00EF); //设置操作窗口的X轴结束列   
        LCD_WriteReg(0x52, 0x0000); //设置操作窗口的Y轴开始行   
        LCD_WriteReg(0x53, 0x013F); //设置操作窗口的Y轴结束行   
        LCD_WriteReg(0x60, 0x2700); //Driver Output Control   
        //设置屏幕的点数以及扫描的起始行   
        LCD_WriteReg(0x61, 0x0001); //Driver Output Control   
        LCD_WriteReg(0x6A, 0x0000); //Vertical Scroll Control   
        LCD_WriteReg(0x80, 0x0000); //Display Position – Partial Display 1   
        LCD_WriteReg(0x81, 0x0000); //RAM Address Start – Partial Display 1   
        LCD_WriteReg(0x82, 0x0000); //RAM address End - Partial Display 1   
        LCD_WriteReg(0x83, 0x0000); //Display Position – Partial Display 2   
        LCD_WriteReg(0x84, 0x0000); //RAM Address Start – Partial Display 2   
        LCD_WriteReg(0x85, 0x0000); //RAM address End – Partail Display2   
        LCD_WriteReg(0x90, 0x0013); //Frame Cycle Control   
        LCD_WriteReg(0x92, 0x0000); //Panel Interface Control 2   
        LCD_WriteReg(0x93, 0x0003); //Panel Interface control 3   
        LCD_WriteReg(0x95, 0x0110); //Frame Cycle Control   
        LCD_WriteReg(0x07, 0x0173);   
        delay_ms(50);   
    }   
    else if(lcddev.id == 0x1505) //OK   
    {   
        // second release on 3/5  ,luminance is acceptable,water wave appear during camera preview   
        LCD_WriteReg(0x0007, 0x0000);   
        delay_ms(50);   
        LCD_WriteReg(0x0012, 0x011C); //0x011A   why need to set several times?   
        LCD_WriteReg(0x00A4, 0x0001); //NVM   
        LCD_WriteReg(0x0008, 0x000F);   
        LCD_WriteReg(0x000A, 0x0008);   
        LCD_WriteReg(0x000D, 0x0008);   
        //伽马校正   
        LCD_WriteReg(0x0030, 0x0707);   
        LCD_WriteReg(0x0031, 0x0007); //0x0707   
        LCD_WriteReg(0x0032, 0x0603);   
        LCD_WriteReg(0x0033, 0x0700);   
        LCD_WriteReg(0x0034, 0x0202);   
        LCD_WriteReg(0x0035, 0x0002); //?0x0606   
        LCD_WriteReg(0x0036, 0x1F0F);   
        LCD_WriteReg(0x0037, 0x0707); //0x0f0f  0x0105   
        LCD_WriteReg(0x0038, 0x0000);   
        LCD_WriteReg(0x0039, 0x0000);   
        LCD_WriteReg(0x003A, 0x0707);   
        LCD_WriteReg(0x003B, 0x0000); //0x0303   
        LCD_WriteReg(0x003C, 0x0007); //?0x0707   
        LCD_WriteReg(0x003D, 0x0000); //0x1313//0x1f08   
        delay_ms(50);   
        LCD_WriteReg(0x0007, 0x0001);   
        LCD_WriteReg(0x0017, 0x0001); //开启电源   
        delay_ms(50);   
        //电源配置   
        LCD_WriteReg(0x0010, 0x17A0);   
        LCD_WriteReg(0x0011, 0x0217); //reference voltage VC[2:0]   Vciout = 1.00*Vcivl   
        LCD_WriteReg(0x0012, 0x011E); //0x011c  //Vreg1out = Vcilvl*1.80   is it the same as Vgama1out ?   
        LCD_WriteReg(0x0013, 0x0F00); //VDV[4:0]-->VCOM Amplitude VcomL = VcomH - Vcom Ampl   
        LCD_WriteReg(0x002A, 0x0000);   
        LCD_WriteReg(0x0029, 0x000A); //0x0001F  Vcomh = VCM1[4:0]*Vreg1out    gate source voltage??   
        LCD_WriteReg(0x0012, 0x013E); // 0x013C  power supply on   
        //Coordinates Control//   
        LCD_WriteReg(0x0050, 0x0000); //0x0e00   
        LCD_WriteReg(0x0051, 0x00EF);   
        LCD_WriteReg(0x0052, 0x0000);   
        LCD_WriteReg(0x0053, 0x013F);   
        //Pannel Image Control//   
        LCD_WriteReg(0x0060, 0x2700);   
        LCD_WriteReg(0x0061, 0x0001);   
        LCD_WriteReg(0x006A, 0x0000);   
        LCD_WriteReg(0x0080, 0x0000);   
        //Partial Image Control//   
        LCD_WriteReg(0x0081, 0x0000);   
        LCD_WriteReg(0x0082, 0x0000);   
        LCD_WriteReg(0x0083, 0x0000);   
        LCD_WriteReg(0x0084, 0x0000);   
        LCD_WriteReg(0x0085, 0x0000);   
        //Panel Interface Control//   
        LCD_WriteReg(0x0090, 0x0013); //0x0010 frenqucy   
        LCD_WriteReg(0x0092, 0x0300);   
        LCD_WriteReg(0x0093, 0x0005);   
        LCD_WriteReg(0x0095, 0x0000);   
        LCD_WriteReg(0x0097, 0x0000);   
        LCD_WriteReg(0x0098, 0x0000);   
   
        LCD_WriteReg(0x0001, 0x0100);   
        LCD_WriteReg(0x0002, 0x0700);   
        LCD_WriteReg(0x0003, 0x1038); //扫描方向 上->下  左->右   
        LCD_WriteReg(0x0004, 0x0000);   
        LCD_WriteReg(0x000C, 0x0000);   
        LCD_WriteReg(0x000F, 0x0000);   
        LCD_WriteReg(0x0020, 0x0000);   
        LCD_WriteReg(0x0021, 0x0000);   
        LCD_WriteReg(0x0007, 0x0021);   
        delay_ms(20);   
        LCD_WriteReg(0x0007, 0x0061);   
        delay_ms(20);   
        LCD_WriteReg(0x0007, 0x0173);   
        delay_ms(20);   
    }   
    else if(lcddev.id == 0xB505)   
    {   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
   
