SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
        LCD_WriteReg(0x00a4, 0x0001);   
        delay_ms(20);   
        LCD_WriteReg(0x0060, 0x2700);   
        LCD_WriteReg(0x0008, 0x0202);   
   
        LCD_WriteReg(0x0030, 0x0214);   
        LCD_WriteReg(0x0031, 0x3715);   
        LCD_WriteReg(0x0032, 0x0604);   
        LCD_WriteReg(0x0033, 0x0e16);   
        LCD_WriteReg(0x0034, 0x2211);   
        LCD_WriteReg(0x0035, 0x1500);   
        LCD_WriteReg(0x0036, 0x8507);   
        LCD_WriteReg(0x0037, 0x1407);   
        LCD_WriteReg(0x0038, 0x1403);   
        LCD_WriteReg(0x0039, 0x0020);   
   
        LCD_WriteReg(0x0090, 0x001a);   
        LCD_WriteReg(0x0010, 0x0000);   
        LCD_WriteReg(0x0011, 0x0007);   
        LCD_WriteReg(0x0012, 0x0000);   
        LCD_WriteReg(0x0013, 0x0000);   
        delay_ms(20);   
   
        LCD_WriteReg(0x0010, 0x0730);   
        LCD_WriteReg(0x0011, 0x0137);   
        delay_ms(20);   
   
        LCD_WriteReg(0x0012, 0x01b8);   
        delay_ms(20);   
   
        LCD_WriteReg(0x0013, 0x0f00);   
        LCD_WriteReg(0x002a, 0x0080);   
        LCD_WriteReg(0x0029, 0x0048);   
        delay_ms(20);   
   
        LCD_WriteReg(0x0001, 0x0100);   
        LCD_WriteReg(0x0002, 0x0700);   
        LCD_WriteReg(0x0003, 0x1038); //扫描方向 上->下  左->右   
        LCD_WriteReg(0x0008, 0x0202);   
        LCD_WriteReg(0x000a, 0x0000);   
        LCD_WriteReg(0x000c, 0x0000);   
        LCD_WriteReg(0x000d, 0x0000);   
        LCD_WriteReg(0x000e, 0x0030);   
        LCD_WriteReg(0x0050, 0x0000);   
        LCD_WriteReg(0x0051, 0x00ef);   
        LCD_WriteReg(0x0052, 0x0000);   
        LCD_WriteReg(0x0053, 0x013f);   
        LCD_WriteReg(0x0060, 0x2700);   
        LCD_WriteReg(0x0061, 0x0001);   
        LCD_WriteReg(0x006a, 0x0000);   
        //LCD_WriteReg(0x0080,0x0000);   
        //LCD_WriteReg(0x0081,0x0000);   
        LCD_WriteReg(0x0090, 0X0011);   
        LCD_WriteReg(0x0092, 0x0600);   
        LCD_WriteReg(0x0093, 0x0402);   
        LCD_WriteReg(0x0094, 0x0002);   
        delay_ms(20);   
   
        LCD_WriteReg(0x0007, 0x0001);   
        delay_ms(20);   
        LCD_WriteReg(0x0007, 0x0061);   
        LCD_WriteReg(0x0007, 0x0173);   
   
        LCD_WriteReg(0x0020, 0x0000);   
        LCD_WriteReg(0x0021, 0x0000);   
        LCD_WriteReg(0x00, 0x22);   
    }   
    else if(lcddev.id == 0xC505)   
    {   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
        delay_ms(20);   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x0000, 0x0000);   
        LCD_WriteReg(0x00a4, 0x0001);   
        delay_ms(20);   
        LCD_WriteReg(0x0060, 0x2700);   
        LCD_WriteReg(0x0008, 0x0806);   
   
        LCD_WriteReg(0x0030, 0x0703); //gamma setting   
        LCD_WriteReg(0x0031, 0x0001);   
        LCD_WriteReg(0x0032, 0x0004);   
        LCD_WriteReg(0x0033, 0x0102);   
        LCD_WriteReg(0x0034, 0x0300);   
        LCD_WriteReg(0x0035, 0x0103);   
        LCD_WriteReg(0x0036, 0x001F);   
        LCD_WriteReg(0x0037, 0x0703);   
        LCD_WriteReg(0x0038, 0x0001);   
        LCD_WriteReg(0x0039, 0x0004);   
   
   
   
        LCD_WriteReg(0x0090, 0x0015);   //80Hz   
        LCD_WriteReg(0x0010, 0X0410);   //BT,AP   
        LCD_WriteReg(0x0011, 0x0247);   //DC1,DC0,VC   
        LCD_WriteReg(0x0012, 0x01BC);   
        LCD_WriteReg(0x0013, 0x0e00);   
        delay_ms(120);   
        LCD_WriteReg(0x0001, 0x0100);   
        LCD_WriteReg(0x0002, 0x0200);   
        LCD_WriteReg(0x0003, 0x1030);   
   
        LCD_WriteReg(0x000A, 0x0008);   
        LCD_WriteReg(0x000C, 0x0000);   
   
        LCD_WriteReg(0x000E, 0x0020);   
        LCD_WriteReg(0x000F, 0x0000);   
        LCD_WriteReg(0x0020, 0x0000);   //H Start   
        LCD_WriteReg(0x0021, 0x0000);   //V Start   
        LCD_WriteReg(0x002A, 0x003D);   //vcom2   
        delay_ms(20);   
        LCD_WriteReg(0x0029, 0x002d);   
        LCD_WriteReg(0x0050, 0x0000);   
        LCD_WriteReg(0x0051, 0xD0EF);   
        LCD_WriteReg(0x0052, 0x0000);   
        LCD_WriteReg(0x0053, 0x013F);   
        LCD_WriteReg(0x0061, 0x0000);   
        LCD_WriteReg(0x006A, 0x0000);   
        LCD_WriteReg(0x0092, 0x0300);   
   
        LCD_WriteReg(0x0093, 0x0005);   
        LCD_WriteReg(0x0007, 0x0100);   
    }   
    else if(lcddev.id == 0x4531) //OK |/|/|   
    {   
        LCD_WriteReg(0X00, 0X0001);   
        delay_ms(10);   
        LCD_WriteReg(0X10, 0X1628);   
        LCD_WriteReg(0X12, 0X000e); //0x0006   
        LCD_WriteReg(0X13, 0X0A39);   
        delay_ms(10);   
        LCD_WriteReg(0X11, 0X0040);   
        LCD_WriteReg(0X15, 0X0050);   
        delay_ms(10);   
        LCD_WriteReg(0X12, 0X001e); //16   
        delay_ms(10);   
        LCD_WriteReg(0X10, 0X1620);   
        LCD_WriteReg(0X13, 0X2A39);   
        delay_ms(10);   
        LCD_WriteReg(0X01, 0X0100);   
        LCD_WriteReg(0X02, 0X0300);   
        LCD_WriteReg(0X03, 0X1038); //改变方向的   
        LCD_WriteReg(0X08, 0X0202);   
        LCD_WriteReg(0X0A, 0X0008);   
        LCD_WriteReg(0X30, 0X0000);   
        LCD_WriteReg(0X31, 0X0402);   
        LCD_WriteReg(0X32, 0X0106);   
        LCD_WriteReg(0X33, 0X0503);   
        LCD_WriteReg(0X34, 0X0104);   
        LCD_WriteReg(0X35, 0X0301);   
        LCD_WriteReg(0X36, 0X0707);   
        LCD_WriteReg(0X37, 0X0305);   
        LCD_WriteReg(0X38, 0X0208);   
        LCD_WriteReg(0X39, 0X0F0B);   
        LCD_WriteReg(0X41, 0X0002);   
        LCD_WriteReg(0X60, 0X2700);   
        LCD_WriteReg(0X61, 0X0001);   
        LCD_WriteReg(0X90, 0X0210);   
        LCD_WriteReg(0X92, 0X010A);   
        LCD_WriteReg(0X93, 0X0004);   
        LCD_WriteReg(0XA0, 0X0100);   
        LCD_WriteReg(0X07, 0X0001);   
        LCD_WriteReg(0X07, 0X0021);   
        LCD_WriteReg(0X07, 0X0023);   
        LCD_WriteReg(0X07, 0X0033);   
        LCD_WriteReg(0X07, 0X0133);   
        LCD_WriteReg(0XA0, 0X0000);   
    }   
    else if(lcddev.id == 0x4535)   
    {   
        LCD_WriteReg(0X15, 0X0030);   
        LCD_WriteReg(0X9A, 0X0010);   
        LCD_WriteReg(0X11, 0X0020);   
        LCD_WriteReg(0X10, 0X3428);   
        LCD_WriteReg(0X12, 0X0002); //16   
        LCD_WriteReg(0X13, 0X1038);   
        delay_ms(40);   
        LCD_WriteReg(0X12, 0X0012); //16   
        delay_ms(40);   
        LCD_WriteReg(0X10, 0X3420);   
        LCD_WriteReg(0X13, 0X3038);   
        delay_ms(70);   
        LCD_WriteReg(0X30, 0X0000);   
        LCD_WriteReg(0X31, 0X0402);   
        LCD_WriteReg(0X32, 0X0307);   
        LCD_WriteReg(0X33, 0X0304);   
        LCD_WriteReg(0X34, 0X0004);   
        LCD_WriteReg(0X35, 0X0401);   
        LCD_WriteReg(0X36, 0X0707);   
        LCD_WriteReg(0X37, 0X0305);   
        LCD_WriteReg(0X38, 0X0610);   
        LCD_WriteReg(0X39, 0X0610);   
   
        LCD_WriteReg(0X01, 0X0100);   
        LCD_WriteReg(0X02, 0X0300);   
        LCD_WriteReg(0X03, 0X1030); //改变方向的   
        LCD_WriteReg(0X08, 0X0808);   
        LCD_WriteReg(0X0A, 0X0008);   
        LCD_WriteReg(0X60, 0X2700);   
        LCD_WriteReg(0X61, 0X0001);   
        LCD_WriteReg(0X90, 0X013E);   
        LCD_WriteReg(0X92, 0X0100);   
        LCD_WriteReg(0X93, 0X0100);   
        LCD_WriteReg(0XA0, 0X3000);   
        LCD_WriteReg(0XA3, 0X0010);   
        LCD_WriteReg(0X07, 0X0001);   
        LCD_WriteReg(0X07, 0X0021);   
        LCD_WriteReg(0X07, 0X0023);   
        LCD_WriteReg(0X07, 0X0033);   
        LCD_WriteReg(0X07, 0X0133);   
    }   
    LCD_Display_Dir(0);         //默认为竖屏   
    LCD_LED=0;                 //点亮背光   
    LCD_Clear(WHITE);   
}   
       
//void rt_hw_lcd_update(rtgui_rect_t *rect)   
//{   
//    /* nothing for none-DMA mode driver */   
//} 

//在指定区域内填充单个颜色
//(sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex-sx+1)*(ey-sy+1)   
//color:要填充的颜色
void LCD_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u16 color)
{          
	u16 i,j;
	u16 xlen=0;
	u16 temp;
	if((lcddev.id==0X6804)&&(lcddev.dir==1))	//6804横屏的时候特殊处理  
	{
		temp=sx;
		sx=sy;
		sy=lcddev.width-ex-1;	  
		ex=ey;
		ey=lcddev.width-temp-1;
 		lcddev.dir=0;	 
 		lcddev.setxcmd=0X2A;
		lcddev.setycmd=0X2B;  	 			
		LCD_Fill(sx,sy,ex,ey,color);  
 		lcddev.dir=1;	 
  		lcddev.setxcmd=0X2B;
		lcddev.setycmd=0X2A;  	 
 	}else
	{
		xlen=ex-sx+1;	 
		for(i=sy;i<=ey;i++)
		{
		 	LCD_SetCursor(sx,i);      				//设置光标位置 
			LCD_WriteRAM_Prepare();     			//开始写入GRAM	  
			for(j=0;j<xlen;j++)LCD->LCD_RAM=color;	//显示颜色 	    
		}
	}	 
}  
//在指定区域内填充指定颜色块			 
//(sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex-sx+1)*(ey-sy+1)   
//color:要填充的颜色
void LCD_Color_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u16 *color)
{  
	u16 height,width;
	u16 i,j;
	width=ex-sx+1; 			//得到填充的宽度
	height=ey-sy+1;			//高度
 	for(i=0;i<height;i++)
	{
 		LCD_SetCursor(sx,sy+i);   	//设置光标位置 
		LCD_WriteRAM_Prepare();     //开始写入GRAM
		for(j=0;j<width;j++)LCD->LCD_RAM=color[i*width+j];//写入数据 
	}		  
}  
//画线
//x1,y1:起点坐标
//x2,y2:终点坐标  
void LCD_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 
	delta_x=x2-x1; //计算坐标增量 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1; 
	if(delta_x>0)incx=1; //设置单步方向 
	else if(delta_x==0)incx=0;//垂直线 
	else {incx=-1;delta_x=-delta_x;} 
	if(delta_y>0)incy=1; 
	else if(delta_y==0)incy=0;//水平线 
	else{incy=-1;delta_y=-delta_y;} 
	if( delta_x>delta_y)distance=delta_x; //选取基本增量坐标轴 
	else distance=delta_y; 
	for(t=0;t<=distance+1;t++ )//画线输出 
	{  
		LCD_DrawPoint(uRow,uCol);//画点 
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}    
//画矩形	  
//(x1,y1),(x2,y2):矩形的对角坐标
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2)
{
	LCD_DrawLine(x1,y1,x2,y1);
	LCD_DrawLine(x1,y1,x1,y2);
	LCD_DrawLine(x1,y2,x2,y2);
	LCD_DrawLine(x2,y1,x2,y2);
}
//在指定位置画一个指定大小的圆
//(x,y):中心点
//r    :半径
void LCD_Draw_Circle(u16 x0,u16 y0,u8 r)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             //判断下个点位置的标志
	while(a<=b)
	{
		LCD_DrawPoint(x0+a,y0-b);             //5
 		LCD_DrawPoint(x0+b,y0-a);             //0           
		LCD_DrawPoint(x0+b,y0+a);             //4               
		LCD_DrawPoint(x0+a,y0+b);             //6 
		LCD_DrawPoint(x0-a,y0+b);             //1       
 		LCD_DrawPoint(x0-b,y0+a);             
		LCD_DrawPoint(x0-a,y0-b);             //2             
  		LCD_DrawPoint(x0-b,y0-a);             //7     	         
		a++;
		//使用Bresenham算法画圆     
		if(di<0)di +=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 						    
	}
} 									  
//在指定位置显示一个字符
//x,y:起始坐标
//num:要显示的字符:" "--->"~"
//size:字体大小 12/16/24
//mode:叠加方式(1)还是非叠加方式(0)
void LCD_ShowChar(u16 x,u16 y,u8 num,u8 size,u8 mode)
{  							  
    u8 temp,t1,t;
	u16 y0=y;
	u8 csize=(size/8+((size%8)?1:0))*(size/2);		//得到字体一个字符对应点阵集所占的字节数	
	//设置窗口		   
	num=num-' ';//得到偏移后的值
	for(t=0;t<csize;t++)
	{   
		if(size==12)temp=asc2_1206[num][t]; 	 	//调用1206字体
		else if(size==16)temp=asc2_1608[num][t];	//调用1608字体
		else if(size==24)temp=asc2_2412[num][t];	//调用2412字体
		else return;								//没有的字库
		for(t1=0;t1<8;t1++)
		{			    
			if(temp&0x80)LCD_Fast_DrawPoint(x,y,POINT_COLOR);
			else if(mode==0)LCD_Fast_DrawPoint(x,y,BACK_COLOR);
			temp<<=1;
			y++;
			if(y>=lcddev.height)return;		//超区域了
			if((y-y0)==size)
			{
				y=y0;
				x++;
				if(x>=lcddev.width)return;	//超区域了
				break;
			}
		}  	 
	}  	    	   	 	  
}   
//m^n函数
//返回值:m^n次方.
u32 LCD_Pow(u8 m,u8 n)
{
	u32 result=1;	 
	while(n--)result*=m;    
	return result;
}			 
//显示数字,高位为0,则不显示
//x,y :起点坐标	 
//len :数字的位数
//size:字体大小
//color:颜色 
//num:数值(0~4294967295);	 
void LCD_ShowNum(u16 x,u16 y,u32 num,u8 len,u8 size)
{         	
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				LCD_ShowChar(x+(size/2)*t,y,' ',size,0);
				continue;
			}else enshow=1; 
		 	 
