SharpCube/Project_Screw/bsp/stm32f40x/drivers/drv_lcd.c
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,0); 
	}
} 
//显示数字,高位为0,还是显示
//x,y:起点坐标
//num:数值(0~999999999);	 
//len:长度(即要显示的位数)
//size:字体大小
//mode:
//[7]:0,不填充;1,填充0.
//[6:1]:保留
//[0]:0,非叠加显示;1,叠加显示.
void LCD_ShowxNum(u16 x,u16 y,u32 num,u8 len,u8 size,u8 mode)
{  
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				if(mode&0X80)LCD_ShowChar(x+(size/2)*t,y,'0',size,mode&0X01);  
				else LCD_ShowChar(x+(size/2)*t,y,' ',size,mode&0X01);  
 				continue;
			}else enshow=1; 
		 	 
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,mode&0X01); 
	}
} 
//显示字符串
//x,y:起点坐标
//width,height:区域大小  
//size:字体大小
//*p:字符串起始地址		  
void LCD_ShowString(u16 x,u16 y,u16 width,u16 height,u8 size,u8 *p)
{         
	u8 x0=x;
	width+=x;
	height+=y;
    while((*p<='~')&&(*p>=' '))//判断是不是非法字符!
    {       
        if(x>=width){x=x0;y+=size;}
        if(y>=height)break;//退出
        LCD_ShowChar(x,y,*p,size,0);
        x+=size/2;
        p++;
    }  
}

/*********************************rtthread*************************/  
   
rt_uint8_t * rt_hw_lcd_get_framebuffer(void)   
{   
    return RT_NULL; /* no framebuffer driver */   
}   
   
/*  设置像素点 颜色,X,Y */   
void rt_hw_lcd_set_pixel(const char* pixels, int x, int y)   
{   
   
    LCD_SetCursor(x, y);   
    LCD_WriteRAM_Prepare();   
    LCD_WriteRAM(*(uint16_t *)pixels);     
}   
   
   
/* 获取像素点颜色 */   
void rt_hw_lcd_get_pixel(char* pixels, int x, int y)   
{   
   *(rt_uint16_t*)pixels= LCD_ReadPoint(x,y);   
}   
   
   
/* 画水平线 */   
void rt_hw_lcd_draw_hline(const char* pixels, int x1, int x2, int y)   
{   
   
    rt_uint16_t *ptr;   
      
    ptr = (rt_uint16_t *)pixels;   
       
       
    LCD_SetCursor(x1, y);   
    LCD_WriteRAM_Prepare();   
    while (x1 <= x2)   
    {   
        LCD_WriteRAM(*ptr);   
        x1++;   
    }     
   
}   
 //设置窗口,并自动设置画点坐标到窗口左上角(sx,sy).   
//sx,sy:窗口起始坐标(左上角)   
//width,height:窗口宽度和高度,必须大于0!!   
//窗体大小:width*height.   
//68042,横屏时不支持窗口设置!!    
void LCD_Set_Window(u16 sx,u16 sy,u16 width,u16 height)   
{      
    u8 hsareg,heareg,vsareg,veareg;   
    u16 hsaval,heaval,vsaval,veaval;    
    //width=sx+width-1;   
    //height=sy+height-1;   
    if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X6804)//6804横屏不支持   
    {   
        LCD_WR_REG(lcddev.setxcmd);    
        LCD_WR_DATA(sx>>8);    
        LCD_WR_DATA(sx&0XFF);       
        LCD_WR_DATA(width>>8);    
        LCD_WR_DATA(width&0XFF);     
        LCD_WR_REG(lcddev.setycmd);    
        LCD_WR_DATA(sy>>8);    
        LCD_WR_DATA(sy&0XFF);    
        LCD_WR_DATA(height>>8);    
        LCD_WR_DATA(height&0XFF);    
    }else if(lcddev.id==0X5510)   
    {   
        LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(sx>>8);     
        LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(sx&0XFF);       
        LCD_WR_REG(lcddev.setxcmd+2);LCD_WR_DATA(width>>8);      
        LCD_WR_REG(lcddev.setxcmd+3);LCD_WR_DATA(width&0XFF);      
        LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(sy>>8);      
        LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(sy&0XFF);     
        LCD_WR_REG(lcddev.setycmd+2);LCD_WR_DATA(height>>8);      
        LCD_WR_REG(lcddev.setycmd+3);LCD_WR_DATA(height&0XFF);     
    }else   //其他驱动IC   
    {   
        if(lcddev.dir==1)//横屏   
        {   
            //窗口值   
            hsaval=sy;                 
            heaval=height;   
            vsaval=lcddev.width-width-1;   
            veaval=lcddev.width-sx-1;                  
        }else   
        {    
            hsaval=sx;                 
            heaval=width;   
            vsaval=sy;   
            veaval=height;   
        }    
        hsareg=0X50;heareg=0X51;//水平方向窗口寄存器   
        vsareg=0X52;veareg=0X53;//垂直方向窗口寄存器                                  
        //设置寄存器值   
        LCD_WriteReg(hsareg,hsaval);   
        LCD_WriteReg(heareg,heaval);   
        LCD_WriteReg(vsareg,vsaval);   
        LCD_WriteReg(veareg,veaval);           
        LCD_SetCursor(sx,sy);   //设置光标位置   
    }   
}    
   
/* 垂直线 */   
void rt_hw_lcd_draw_vline(const char* pixels, int x, int y1, int y2)   
{   
   
    rt_uint16_t *ptr;   
   
    ptr = (rt_uint16_t *)pixels;   
    LCD_Set_Window(x, y1,x,y2);   
    LCD_WriteRAM_Prepare();   
    while (y1 < y2)   
    {   
        LCD_WriteRAM(*ptr);   
        y1++;   
    }      
   
}   
   
/* 画起始水平线*/   
void rt_hw_lcd_draw_blit_line(const char* pixels, int x, int y, rt_size_t size)   
{   
    rt_uint16_t *ptr;   
    ptr = (rt_uint16_t*)pixels;   
      
    LCD_SetCursor(x, y);   
    LCD_WriteRAM_Prepare();   
    while (size)   
    {   
        LCD_WriteRAM(*ptr ++);   
        size--;   
    }       
}   
   
/* 下面的东东，就有linux 设备驱动框架的味道了 */   
struct rt_device_graphic_ops lcd_ili_ops =   
{   
    rt_hw_lcd_set_pixel,   
    rt_hw_lcd_get_pixel,   
    rt_hw_lcd_draw_hline,   
    rt_hw_lcd_draw_vline,   
    rt_hw_lcd_draw_blit_line   
};   
   
   
static rt_err_t lcd_init(rt_device_t dev)   
{   
    return RT_EOK;   
}   
   
static rt_err_t lcd_open(rt_device_t dev, rt_uint16_t oflag)   
{   
    return RT_EOK;   
}   
   
static rt_err_t lcd_close(rt_device_t dev)   
{   
    return RT_EOK;   
}   
   
static rt_err_t lcd_control(rt_device_t dev, rt_uint8_t cmd, void *args)   
{   
    switch (cmd)   
    {   
    case RTGRAPHIC_CTRL_GET_INFO:   
    {   
        struct rt_device_graphic_info *info;   
   
        info = (struct rt_device_graphic_info*) args;   
        RT_ASSERT(info != RT_NULL);   
   
        info->bits_per_pixel = 16;   
        info->pixel_format = RTGRAPHIC_PIXEL_FORMAT_RGB565P;   
        info->framebuffer = RT_NULL;   
   
        info->width = lcddev.width;   
        info->height =lcddev.height ;   
   
    }   
    break;   
   
    case RTGRAPHIC_CTRL_RECT_UPDATE:   
        /* nothong to be done */   
        break;   
   
    default:   
        break;   
    }   
   
    return RT_EOK;   
}   
   
/* 需直接调用的 用于硬件初始化和注册设备 */   
int rt_hw_lcd_init(void)   
{   
    /* register lcd device */   
    _lcd_device.type  = RT_Device_Class_Graphic;   
    _lcd_device.init  = lcd_init;   
    _lcd_device.open  = lcd_open;   
    _lcd_device.close = lcd_close;   
    _lcd_device.control = lcd_control;   
    _lcd_device.read  = RT_NULL;   
    _lcd_device.write = RT_NULL;   
   
    _lcd_device.user_data = &lcd_ili_ops;   
   
    LCD_Init();   
   
    /* register graphic device driver */   
    rt_device_register(&_lcd_device, "lcd",   
                       RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_STANDALONE);   
    return 0;   
}   
INIT_DEVICE_EXPORT(rt_hw_lcd_init);   
   
 
   
  
